## Pandas Datenframe Exkurs

Daten aus csv Datei auslesen:

In [15]:
import pandas as pd
import os


folder = os.path.expanduser("~") + "/Desktop/Kursmaterialien/6 - praxisprojekt - Firefox/"
df = pd.read_csv(folder + "students.csv")
df

   id   firstname     surname     subject  semester
0   1      Monika  Mustermann  Informatik         3
1   2         Max      Müller       Mathe         2
2   3       Erika      Müller         BWL         5
3   4       Laura  Mustermann       Mathe         2
4   5     Andreas     Schmidt  Informatik         4
5   7  Maximilian   Schneider         BWL         4
6   8      Moritz     Fischer  Informatik         4

Daten aus Excell Datei auslesen:

In [14]:
pd.read_csv(folder + "students_from_excel.csv", delimiter=";")

   id   firstname     surname     subject  semester
0   1      Monika  Mustermann  Informatik         3
1   2         Max      Müller       Mathe         2
2   3       Erika      Müller         BWL         5
3   4       Laura  Mustermann       Mathe         2
4   5     Andreas     Schmidt  Informatik         4
5   7  Maximilian   Schneider         BWL         4
6   8      Moritz     Fischer  Informatik         4

In [21]:
df["subject"] =="Mathe"

0    False
1     True
2    False
3     True
4    False
5    False
6    False
Name: subject, dtype: bool

In [20]:
df["subject"] =="Informatik"

0     True
1    False
2    False
3    False
4     True
5    False
6     True
Name: subject, dtype: bool

In [31]:
df[(df["subject"] == "Mathe") | (df["subject"] == "Informatik")]

   id firstname     surname     subject  semester
0   1    Monika  Mustermann  Informatik         3
1   2       Max      Müller       Mathe         2
3   4     Laura  Mustermann       Mathe         2
4   5   Andreas     Schmidt  Informatik         4
6   8    Moritz     Fischer  Informatik         4